#+PROPERTY: header-args:lisp :results replace

* check if lisp runs correctly
#+name: hello-world
#+header: :var message="Hello World!"
#+begin_src lisp
  (princ message)
#+end_src

#+RESULTS: hello-world
Hello World!

* prepare sbcl-setup

#+name: sbcl-setup
#+begin_src lisp
  (load (sb-ext:posix-getenv "ASDF"))
  (pushnew (truename "./.") asdf:*central-registry*)
#+end_src

#+RESULTS: sbcl-setup
(#P"/home/ckb/cl-tutorial/"
 #P"/home/ckb/.config/emacs/elpa/sly-20240809.2119/contrib/"
 #P"/home/ckb/.config/emacs/elpa/sly-20240809.2119/slynk/")

